# Data Manipulation and Analysis with Pandas

Data manipulation and analysis are key tasks in any data science or data analysis project. Pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean, transform and extract insights from data. In this lesson, we will cover various data manipulation and analysis techniques using Pandas.

In [3]:
import pandas as pd

In [34]:
df=pd.read_csv('data.csv')
# fetch the first 5 rows
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product5  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [35]:
df.tail(5)

          Date Category  Value   Product  Sales Region
35  2023-02-05        B   67.0  Product4  831.0   West
36  2023-02-06        C   41.0  Product2  519.0   East
37  2023-02-07        A   95.0  Product5  963.0  North
38  2023-02-08        B   29.0  Product3  374.0  South
39  2023-02-09        C   52.0  Product1  688.0   West

In [31]:
df.describe()

           Value       Sales
count  40.000000   40.000000
mean   45.150000  546.550000
std    27.565819  288.880416
min     0.000000    0.000000
25%    25.500000  360.750000
50%    40.000000  572.500000
75%    67.500000  799.500000
max    95.000000  963.000000

In [19]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [36]:
# Handling Missing Values
# df[df.isnull()]

# df.isnull().any(axis=1)
df.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales       False
Region       True
dtype: bool

In [37]:
df.isnull().sum()

Date        0
Category    0
Value       2
Product     0
Sales       0
Region      1
dtype: int64

In [39]:
df_filled=df.fillna(0)

In [41]:
# filling missing values with the mean of the column
df['Sales_fillNA']=df['Sales'].fillna(df['Sales'].mean())
df

          Date Category  Value   Product  Sales Region  Sales_fillNA
0   2023-01-01        A   28.0  Product1  754.0   East         754.0
1   2023-01-02        B   39.0  Product3  110.0  North         110.0
2   2023-01-03        C   32.0  Product5  398.0   East         398.0
3   2023-01-04        B    8.0  Product1  522.0   East         522.0
4   2023-01-05        B   26.0  Product3  869.0  North         869.0
5   2023-01-06        B   54.0  Product3  192.0   West         192.0
6   2023-01-07        A   16.0  Product1   36.0   East          36.0
7   2023-01-08        C    NaN  Product1  488.0   West         488.0
8   2023-01-09        C   37.0  Product3  772.0   West         772.0
9   2023-01-10        A    NaN  Product2  834.0   West         834.0
10  2023-01-11        B    7.0  Product1  842.0  North         842.0
11  2023-01-12        B   60.0  Product2    0.0   West           0.0
12  2023-01-13        A   70.0  Product3  628.0  South         628.0
13  2023-01-14        A   69.0  Product1  423.0   East         423.0
14  2023-01-15        A   47.0  Product2  893.0   West         893.0
15  2023-01-16        C    0.0  Product1  895.0  North         895.0
16  2023-01-17        C   93.0  Product2  511.0  South         511.0
17  2023-01-18        C    0.0  Product1    0.0   West           0.0
18  2023-01-19        A   31.0  Product2  578.0   West         578.0
19  2023-01-20        A   59.0  Product1  736.0   East         736.0
20  2023-01-21        B   42.0  Product4  612.0    NaN         612.0
21  2023-01-22        C   15.0  Product2  245.0   East         245.0
22  2023-01-23        A   88.0  Product5  901.0  South         901.0
23  2023-01-24        B   33.0  Product3  456.0   West         456.0
24  2023-01-25        C   71.0  Product1  789.0   East         789.0
25  2023-01-26        A   19.0  Product4  134.0  North         134.0
26  2023-01-27        B   64.0  Product2  567.0  South         567.0
27  2023-01-28        C   27.0  Product5  321.0   West         321.0
28  2023-01-29        A   90.0  Product3  845.0   East         845.0
29  2023-01-30        B   11.0  Product1   98.0  North          98.0
30  2023-01-31        C   56.0  Product4  672.0  South         672.0
31  2023-02-01        A   73.0  Product2  914.0   West         914.0
32  2023-02-02        B   38.0  Product5  407.0   East         407.0
33  2023-02-03        C   84.0  Product3  756.0  North         756.0
34  2023-02-04        A   24.0  Product1  289.0  South         289.0
35  2023-02-05        B   67.0  Product4  831.0   West         831.0
36  2023-02-06        C   41.0  Product2  519.0   East         519.0
37  2023-02-07        A   95.0  Product5  963.0  North         963.0
38  2023-02-08        B   29.0  Product3  374.0  South         374.0
39  2023-02-09        C   52.0  Product1  688.0   West         688.0

In [42]:
df.dtypes

Date             object
Category         object
Value           float64
Product          object
Sales           float64
Region           object
Sales_fillNA    float64
dtype: object

In [46]:
# Remaining Columns
df=df.rename(columns={'Date':'Sales Date'})
df.head()

   Sales Date Category  Value   Product  Sales Region  Sales_fillNA
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product5  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [48]:
# change datatypes
df['Value_new']=df['Value'].fillna(df['Value'].mean()).astype(int)
df.head()

   Sales Date Category  Value   Product  Sales Region  Sales_fillNA  Value_new
0  2023-01-01        A   28.0  Product1  754.0   East         754.0         28
1  2023-01-02        B   39.0  Product3  110.0  North         110.0         39
2  2023-01-03        C   32.0  Product5  398.0   East         398.0         32
3  2023-01-04        B    8.0  Product1  522.0   East         522.0          8
4  2023-01-05        B   26.0  Product3  869.0  North         869.0         26

In [50]:
df['New Value']=df['Value'].apply(lambda x:x*2)
df.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_fillNA,Value_new,New Value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78.0
2,2023-01-03,C,32.0,Product5,398.0,East,398.0,32,64.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52.0

In [51]:
# Data Aggregating and Grouping
df.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_fillNA,Value_new,New Value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78.0
2,2023-01-03,C,32.0,Product5,398.0,East,398.0,32,64.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52.0

In [52]:
grouped_mean=df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    28.750000
Product2    53.000000
Product3    51.333333
Product4    46.000000
Product5    56.000000
Name: Value, dtype: float64

In [53]:
grouped_sum=df.groupby(['Product','Region'])['Value'].sum()
print(grouped_sum)

Product   Region
Product1  East      251.0
          North      18.0
          South      24.0
          West       52.0
Product2  East       56.0
          South     157.0
          West      211.0
Product3  East       90.0
          North     149.0
          South      99.0
          West      124.0
Product4  North      19.0
          South      56.0
          West       67.0
Product5  East       70.0
          North      95.0
          South      88.0
          West       27.0
Name: Value, dtype: float64

In [54]:
grouped_mean=df.groupby(['Product','Region'])['Value'].mean()
print(grouped_mean)

Product   Region
Product1  East      41.833333
          North      6.000000
          South     24.000000
          West      26.000000
Product2  East      28.000000
          South     78.500000
          West      52.750000
Product3  East      90.000000
          North     49.666667
          South     49.500000
          West      41.333333
Product4  North     19.000000
          South     56.000000
          West      67.000000
Product5  East      35.000000
          North     95.000000
          South     88.000000
          West      27.000000
Name: Value, dtype: float64

In [55]:
# aggregate multiple functions
grouped_agg=df.groupby('Region')['Value'].agg(['mean','sum','count'])
grouped_agg

             mean    sum  count
Region
East    42.454545  467.0     11
North   35.125000  281.0      8
South   60.571429  424.0      7
West    43.727273  481.0     11

In [56]:
# Merging and joining Dataframes
# create sample DataFrames
df1=pd.DataFrame({'Key':['A','B','C'],'Value1':[1,2,3]})
df2=pd.DataFrame({'Key':['A','B','D'],'Value2':[4,5,6]})

In [57]:
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [59]:
df2

  Key  Value2
0   A       4
1   B       5
2   D       6

In [63]:
# Merge DataFrame on the 'Key Columns'
pd.merge(df1,df2,on="Key",how="inner")

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [64]:
pd.merge(df1,df2,on="Key",how="outer")

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [65]:
pd.merge(df1,df2,on="Key",how="left")

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [66]:
pd.merge(df1,df2,on="Key",how="right")

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6